subject_choices = [(1, '语文'), (2, '数学'), (3, '英语'), (4, '物理'),
                   (5, '化学'), (6, '生物'), (7, '历史'), (8, '地理'), (9, '政治')]

grade_choices = [(1, '小一'), (2, '小二'), (3, '小三'), (4, '小四'),
                 (5, '小五'), (6, '小六'), (7, '初一'), (8, '初二'),
                 (9, '初三'), (10, '高一'), (11, '高二'), (12, '高三')]

exam_type_choices = [(0, '周测'), (1, '月考'), (2, '期中'), (3, '期末'), (4, '其它')]

center_choice = [(0, '郑州大区')]

branch_choices = [(1, '校区1'), (2, '校区2'), (3, '校区3'), (4, '校区4'),
                  (5, '校区5'), (6, '校区6'), (7, '校区7'), (8, '校区8')]

sex_choices = [(0, '女'), (1, '男')]

attendance_choices = [(0, '正常'), (1, '老师缺席'), (2, '学生缺席'),
                      (3, '老师迟到'), (4, '学生迟到'), (5, '老师请假'),
                      (6, '学生请假')]

course_status_choices = ((1, 'finished'), (2, 'deleted'), (3, 'waiting'), (4, 'reschedule'))

duty_choices = [(0, '教研部'), (1, '班主任'), (2, '专职教师')]
